IDENTIFICATION DIVISION.
 File update. Works fine. Don't mess with it.
 this is a good way to do it.  Use this as a model.
 transaction codes used.  Multiple trans allowed for same account
PROGRAM-ID. FILEUPD1.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT TRANS-FILE  ASSIGN TRANSFIL.
    SELECT OLD-MASTER  ASSIGN OLDMAST.
    SELECT NEW-MASTER  ASSIGN NEWMAST.
DATA DIVISION.
FILE SECTION.

FD  TRANS-FILE
    RECORDING MODE IS F
    RECORD CONTAINS  80 CHARACTERS.
01  TRANS-RECORD.
     05  TR-ACCT-NO           PIC X(5).
     05  FILLER               PIC X(5).
     05  TR-AMOUNT            PIC 9(5).
     05  FILLER               PIC X(5).
     05  TR-CUST-NAME         PIC X(10).
     05  TR-TRANS-CODE        PIC X(1).
         88  ADD-TRANS    VALUE 'A'.
         88  CHANGE-TRANS VALUE 'C'.
         88  DELETE-TRANS VALUE 'D'.
     05  FILLER               PIC X(44).

FD  OLD-MASTER
    RECORDING MODE IS F
    RECORD CONTAINS  80 CHARACTERS.

01  OLD-MASTER-RECORD.
     05  OM-ACCT-NO           PIC X(05).
     05  FILLER               PIC X(05).
     05  OM-AMOUNT            PIC 9(05).
     05  FILLER               PIC X(05).
     05  OM-CUST-NAME         PIC X(10).
     05  FILLER               PIC X(50).

FD  NEW-MASTER
    RECORDING MODE IS F
    RECORD CONTAINS  80 CHARACTERS.

01  NEW-MASTER-RECORD.
     05  NM-ACCT-NO           PIC X(05).
     05  FILLER               PIC X(05).
     05  NM-AMOUNT            PIC 9(05).
     05  FILLER               PIC X(05).
     05  NM-CUST-NAME         PIC X(10).
     05  FILLER               PIC X(50).

 WORKING-STORAGE SECTION.
01  SWITCHES.
    05  MASTER-EOF                  PIC X  VALUE 'N'.

    05  TRANS-EOF                   PIC X  VALUE 'N'.

    05  SW-FINISHED-WITH-DATA       PIC X  VALUE 'N'.
        88  FINISHED-WITH-DATA             VALUE 'Y'.
        88  NOT-FINISHED-WITH-DATA         VALUE 'N'.

    05  SW-FIRST-TIME               PIC X  VALUE 'Y'.
        88  IT-IS-FIRST-TIME               VALUE 'Y'.

    05  SW-VALID-DELETE             PIC X  VALUE 'N'.
        88  VALID-DELETE                   VALUE 'Y'.

    05  SW-VALID-ADD                 PIC X VALUE 'N'.
        88  VALID-ADD                      VALUE 'Y'.

01  NEW-MASTER-WORK-AREA.
    05  WORK-NM-ACCT-NO      PIC X(05).
    05  FILLER               PIC X(05).
    05  WORK-NM-AMOUNT       PIC 9(05).
    05  FILLER               PIC X(05).
    05  WORK-NM-CUST-NAME    PIC X(10).
    05  FILLER               PIC X(50).

PROCEDURE DIVISION.

    PERFORM INITIALIZATION
    PERFORM PROCESS-BOTH-FILES
       UNTIL MASTER-EOF = 'Y'
       AND   TRANS-EOF  = 'Y'
    IF FINISHED-WITH-DATA
    THEN
       PERFORM WRITE-NEW-MASTER
    END-IF
    PERFORM TERMINATION
    GOBACK.

INITIALIZATION.
    OPEN INPUT TRANS-FILE
                OLD-MASTER
    OPEN OUTPUT NEW-MASTER
    MOVE SPACES TO NEW-MASTER-WORK-AREA
    MOVE 'N' TO  MASTER-EOF
    MOVE 'N' TO TRANS-EOF
    MOVE 'N' TO SW-FINISHED-WITH-DATA
    MOVE 'Y' TO SW-FIRST-TIME
    MOVE 'N'  TO SW-VALID-DELETE
    MOVE 'N' TO SW-VALID-ADD
    PERFORM GET-NEW-MASTER-DATA.

PROCESS-BOTH-FILES.
    PERFORM WRITE-NEW-MASTER
    PERFORM GET-NEW-MASTER-DATA.

 WRITE-NEW-MASTER.
    MOVE FIELDS OF WORK AREA MASTER TO NEW MASTER RECORD
    MOVE SPACES           TO NEW-MASTER-RECORD
    MOVE WORK-NM-ACCT-NO  TO NM-ACCT-NO
    MOVE WORK-NM-AMOUNT   TO NM-AMOUNT
    WRITE NEW-MASTER-RECORD.

GET-NEW-MASTER-DATA.
    MOVE 'N' TO SW-FINISHED-WITH-DATA
    IF IT-IS-FIRST-TIME
    THEN
       PERFORM READ-TRANS
       PERFORM READ-MASTER
       MOVE 'N' TO SW-FIRST-TIME
     END-IF
    PERFORM COMPARE-ACCT-NO
       UNTIL FINISHED-WITH-DATA
       OR    (MASTER-EOF = 'Y'
              AND TRANS-EOF = 'Y').

COMPARE-ACCT-NO.
    MOVE 'N'  TO SW-VALID-DELETE
    MOVE 'N'  TO SW-VALID-ADD
    IF MASTER-EOF IS NOT EQUAL TO 'Y'
    AND TRANS-EOF IS NOT EQUAL TO 'Y'
    THEN
       PERFORM MORE-RECORDS-IN-BOTH
    ELSE
       PERFORM ONE-FILE-IS-AT-END
    END-IF.

MORE-RECORDS-IN-BOTH.
    IF TR-ACCT-NO IS EQUAL TO  OM-ACCT-NO
    THEN
       PERFORM TR-EQUAL-OM
    ELSE
    IF TR-ACCT-NO IS GREATER THAN OM-ACCT-NO
    THEN
       PERFORM TR-GREATER-THAN-OM
    ELSE
    IF TR-ACCT-NO IS LESS THAN OM-ACCT-NO
    THEN
       PERFORM TR-LESS-THAN-OM
    END-IF.

ONE-FILE-IS-AT-END.
    IF MASTER-EOF IS EQUAL TO 'Y'
    THEN
       PERFORM ADD-THIS-TRANS-IF-POSSIBLE
       IF VALID-ADD
       THEN
          MOVE 'Y' TO SW-FINISHED-WITH-DATA
          PERFORM READ-TRANS
       ELSE
          PERFORM READ-TRANS
       END-IF
    ELSE
       THERE ARE MORE MSTR RECORDS
       PERFORM JUST-MOVE-OM-TO-WORK
       MOVE 'Y' TO SW-FINISHED-WITH-DATA
       PERFORM READ-MASTER
    END-IF.

 TR-EQUAL-OM.
    PERFORM APPLY-TRANSACTION
    IF VALID-DELETE
    THEN
       PERFORM READ-MASTER
       PERFORM READ-TRANS
    ELSE
       PERFORM READ-TRANS
    END-IF.

APPLY-TRANSACTION.
    IF CHANGE-TRANS
    THEN
       PERFORM PROCESS-CHANGE-TRANS
    ELSE
    IF DELETE-TRANS
    THEN
       MOVE 'Y' TO SW-VALID-DELETE
    ELSE
    IF ADD-TRANS
    THEN
       DISPLAY 'ALREADY ON FILE, CANNOT ADD THIS TRANSACTION'
       DISPLAY TRANS-RECORD
       DISPLAY SPACES
    END-IF.

TR-LESS-THAN-OM.
    PERFORM ADD-THIS-TRANS-IF-POSSIBLE
    IF VALID-ADD
    THEN
       MOVE 'Y' TO SW-FINISHED-WITH-DATA
       PERFORM READ-TRANS
    ELSE
       PERFORM READ-TRANS
    END-IF.

ADD-THIS-TRANS-IF-POSSIBLE.
    IF ADD-TRANS
    THEN
       MOVE TR-ACCT-NO   TO WORK-NM-ACCT-NO
       MOVE TR-AMOUNT    TO WORK-NM-AMOUNT
       MOVE TR-CUST-NAME TO WORK-NM-CUST-NAME
       MOVE 'Y'    TO SW-VALID-ADD
    ELSE
       DISPLAY 'NO MATCH, CANNOT CHANGE/DELETE'
       DISPLAY TRANS-RECORD
       DISPLAY SPACES
    END-IF.

TR-GREATER-THAN-OM.
    PERFORM JUST-MOVE-OM-TO-WORK
    MOVE 'Y' TO SW-FINISHED-WITH-DATA
    PERFORM READ-MASTER.

JUST-MOVE-OM-TO-WORK.
    MOVE OM-ACCT-NO   TO WORK-NM-ACCT-NO
    MOVE OM-AMOUNT    TO WORK-NM-AMOUNT
    MOVE OM-CUST-NAME TO WORK-NM-CUST-NAME.

 PROCESS-CHANGE-TRANS.
    IF TR-CUST-NAME IS NOT EQUAL TO SPACES
    THEN
       MOVE TR-CUST-NAME TO OM-CUST-NAME
    END-IF
    ADD TR-AMOUNT TO OM-AMOUNT.
READ-MASTER.
    READ OLD-MASTER
        AT END MOVE 'Y' TO MASTER-EOF
     END-READ.
READ-TRANS.
    READ TRANS-FILE
        AT END MOVE 'Y' TO TRANS-EOF
     END-READ.
TERMINATION.
    CLOSE TRANS-FILE
          OLD-MASTER
          NEW-MASTER.